CSI API ETABS v1
cPluginCallback.ErrorFlag Property
 Indicates whether an error occurred
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int ErrorFlag { get; }
ReadOnly Property ErrorFlag As Integer
	Get
Dim instance As cPluginCallback
Dim value As Integer
value = instance.ErrorFlag
property int ErrorFlag {
	int get ();
}
abstract ErrorFlag : int with get
Return Value
Type: Int32
 Zero if the plugin completed successfully; a non-zero value indicates that an error occurred
See Also
Reference
cPluginCallback Interface
ETABSv1 Namespace